import { v4 as uuidv4 } from "uuid";

const headerData = ["الحرف", "مخرجه", "صفاته", "مستوى قوة الحرف"];
const bodyData = [
  {
    id: uuidv4(),
    character: "ء",
    outPut: "أقصى الحلق",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشدة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "متوسط",
      char3:
        "لتساوي صفات القوة وهما الجهر والشدة مع صفات الضعف وهما الاستفال والانفتاح",
    },
  },

  {
    id: uuidv4(),
    character: "ب",
    outPut: " الشفتان بانطباقهما",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشدة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "قلقلة",
      char2: "لغة : التحريك والاضطراب ",
      char3: "اصطلاحاً : قوى اضطراب صوت الحرف عند النطق به ساكناً",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى",
      char3:
        "لزيادة صفات القوة وهما الجهر والشدة و القلقلة على صفات الضعف وهما الاستفال والانفتاح",
    },
  },
  {
    id: uuidv4(),
    character: "ت",
    outPut: "  طرف اللسان مع لثة الثنايا العليا بإلصاق",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف",
      char3:
        "لزيادة صفات الضعف وهما الهمس والاستفال والانفتاح و القلقلة على صفات القوة وهي الشدة فقط ",
    },
  },
  {
    id: uuidv4(),
    character: "ث",
    outPut: "  طرف اللسان مع  الثنايا العليا ",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف جدا",
      char3: "ضعيف جدا لعدم وجود صفات القوة فيه",
    },
  },
  {
    id: uuidv4(),
    character: "ج",
    outPut: "  وسط اللسان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشدة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "قلقلة",
      char2: "لغة : التحريك والاضطراب ",
      char3: "اصطلاحاً : قوى اضطراب صوت الحرف عند النطق به ساكناً",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى",
      char3:
        "لزيادة صفات القوة وهما الجهر والشدة و القلقلة على صفات الضعف وهما الاستفال والانفتاح",
    },
  },
  {
    id: uuidv4(),
    character: "ح",
    outPut: "وسط الحلق",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف جدا",
      char3: "ضعيف جدا لعدم وجود صفات القوة فيه",
    },
  },
  {
    id: uuidv4(),
    character: "خ",
    outPut: "ادنى الحلق",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استعلاء",
      char2: "لغة : ارتفاع ",
      char3: "اصطلاحاً : ارتفاع أقصى اللسان عند النطق فيرتفع الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الهمس والرخاوة والانفتاح على صفات القوة وهي الشدة فقط ",
    },
  },
  {
    id: uuidv4(),
    character: "د",
    outPut: "طرف اللسان مع لثة الثنايا العليا",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "قلقلة",
      char2: "لغة : التحريك والاضطراب ",
      char3: "اصطلاحاً : قوى اضطراب صوت الحرف عند النطق به ساكناً",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى",
      char3:
        "لزيادة صفات القوة وهما الجهر والشدة و القلقلة على صفات الضعف وهما الاستفال والانفتاح",
    },
  },
  {
    id: uuidv4(),
    character: "ذ",
    outPut: "طرف اللسان مع لثة الثنايا العليا",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الاستفال والانفتاح على صفات القوة وهي الجهر والرخاوة ",
    },
  },
  {
    id: uuidv4(),
    character: "ر",
    outPut: "طرف اللسان مع الحاذية من الحنك الأعلى ",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "التوسط",
      char2: "لغة : الاعتدال ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "انحراف",
      char2: "لغة : الميل",
      char3: `اصطلاحاً : ميل الحرف عند مخرجه لاعتراض اللسان طريقه`,
      char4: "تكرار",
      char5: "لغةً : اعادة الشئ مرة بعد مرة",
      char6: "اصطلاحاً : ارتعاد طرف اللسان ارتعاداً خفيفا",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى ",
      char3:
        "لزيادة صفات القوة وهما الجهر والانحراف والتكرير  على صفات الضعف وهي الاستفال والانفتاح أما التوسط فلا يوصف بالقوة او الضعف ",
    },
  },
  {
    id: uuidv4(),
    character: "ز",
    outPut: " تباعد طرف اللسان مع لثة الثنايا العليا",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "صفير",
      char2: "لغة : حدة في الصوت ",
      char3: "اصطلاحاً : حدة في الصوت تنشأ عند مروره من مجرى ضيق  ",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة وهي الجهر الصفير ",
    },
  },
  {
    id: uuidv4(),
    character: "س",
    outPut: "طرف اللسان",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "صفير",
      char2: "لغة : حدة في الصوت ",
      char3: "اصطلاحاً : حدة في الصوت تنشأ عند مروره من مجرى ضيق  ",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة وهي الصفير ",
    },
  },
  {
    id: uuidv4(),
    character: "ش",
    outPut: "وسط اللسان",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "تغشي",
      char2: "لغة : الانتشار",
      char3: "اصطلاحاً : انتشار الهواء في الفم",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة",
    },
  },
  {
    id: uuidv4(),
    character: "ص",
    outPut: "طرف اللسان",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استعلاء",
      char2: "لغة : ارتفاع ",
      char3: "اصطلاحاً : ارتفاع أقصى اللسان عند النطق فيرتفع الصوت",
    },

    prop4: {
      char1: "اطباق",
      char2: "لغة : التصاق ",
      char3: "اصطلاحاً : انحسار الصوت عند النظق بالحرف",
    },
    prop5: {
      char1: "صفير",
      char2: "لغة : حدة في الصوت ",
      char3: "اصطلاحاً : حدة في الصوت تنشأ عند مروره من مجرى ضيق  ",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى ",
      char3:
        "لزيادة صفات القوة وهما الاستعلاء الاطباق والصفير  على صفات الضعفف ",
    },
  },
  {
    id: uuidv4(),
    character: "ض",
    outPut: "حافتي اللسان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استعلاء",
      char2: "لغة : ارتفاع ",
      char3: "اصطلاحاً : ارتفاع أقصى اللسان عند النطق فيرتفع الصوت",
    },

    prop4: {
      char1: "اطباق",
      char2: "لغة : التصاق ",
      char3: "اصطلاحاً : انحسار الصوت عند النظق بالحرف",
    },
    prop5: {
      char1: "استطالة",
      char2: "لغة : احتداد",
      char3: "اصطلاحاً : احتداد الحرف عند خروجه",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى ",
      char3:
        "لزيادة صفات القوة وهما الاستعلاء الاطباق الاستطالة على صفات الضعفف ",
    },
  },
  {
    id: uuidv4(),
    character: "ط",
    outPut: "طرفي اللسان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استعلاء",
      char2: "لغة : ارتفاع ",
      char3: "اصطلاحاً : ارتفاع أقصى اللسان عند النطق فيرتفع الصوت",
    },

    prop4: {
      char1: "اطباق",
      char2: "لغة : التصاق ",
      char3: "اصطلاحاً : انحسار الصوت عند النظق بالحرف",
    },
    prop5: {
      char1: "قلقلة",
      char2: "لغة : التحريك والاضطراب ",
      char3: "اصطلاحاً : قوى اضطراب صوت الحرف عند النطق به ساكناً",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى جداً ",
      char3: "لزيادة صفات القوة وهما الاستعلاء الاطباق الشدة على صفات الضعفف ",
    },
  },
  {
    id: uuidv4(),
    character: "ظ",
    outPut: "طرفي اللسان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استعلاء",
      char2: "لغة : ارتفاع ",
      char3: "اصطلاحاً : ارتفاع أقصى اللسان عند النطق فيرتفع الصوت",
    },

    prop4: {
      char1: "اطباق",
      char2: "لغة : التصاق ",
      char3: "اصطلاحاً : انحسار الصوت عند النظق بالحرف",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى ",
      char3: "لزيادة صفات القوة على صفات الضعفف ",
    },
  },
  {
    id: uuidv4(),
    character: "ع",
    outPut: "وسط اللسان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "التوسط",
      char2: "لغة : الاعتدال ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الاستفال والانفتاح والتوسط على صفات القوة وهي الجهر   ",
    },
  },
  {
    id: uuidv4(),
    character: "غ",
    outPut: "ادنى الحلق ",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استعلاء",
      char2: "لغة : ارتفاع ",
      char3: "اصطلاحاً : ارتفاع أقصى اللسان عند النطق فيرتفع الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "متوسط ",
      char3: "لتساوي صفات الضعف و صفات القوة",
    },
  },
  {
    id: uuidv4(),
    character: "ف",
    outPut: " الشفتان",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف جداً ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة   ",
    },
  },
  {
    id: uuidv4(),
    character: "ق",
    outPut: " أقصى اللسان ",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشدة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استعلاء",
      char2: "لغة : ارتفاع ",
      char3: "اصطلاحاً : ارتفاع أقصى اللسان عند النطق فيرتفع الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "قلقلة",
      char2: "لغة : التحريك والاضطراب ",
      char3: "اصطلاحاً : قوى اضطراب صوت الحرف عند النطق به ساكناً",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى",
      char3:
        "لزيادة صفات القوة وهما الجهر والشدة و القلقلة على صفات الضعف وهما الاستفال والانفتاح",
    },
  },
  {
    id: uuidv4(),
    character: "ك",
    outPut: " أقصى اللسان ",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف",
      char3:
        "لزيادة صفات الضعف وهما الهمس والاستفال والانفتاح و القلقلة على صفات القوة وهي الشدة فقط ",
    },
  },
  {
    id: uuidv4(),
    character: "ل",
    outPut: "حافتي اللسان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "التوسط",
      char2: "لغة : الاعتدال ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "انحراف",
      char2: "لغة : الميل",
      char3: `اصطلاحاً : ميل الحرف عند مخرجه لاعتراض اللسان طريقه`,
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "متوسط ",
      char3: "لتساوي صفات الضعف و صفات القوة",
    },
  },
  {
    id: uuidv4(),
    character: "م",
    outPut: " الشفتان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "التوسط",
      char2: "لغة : الاعتدال ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "غنة",
      char2: "غُنّة : صوت من الخيشوم",
      char3: `اصطلاحاً : ميل الحرف عند مخرجه لاعتراض اللسان طريقه`,
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "متوسط ",
      char3: "اصطلاحاً : صوت أغن لذيذ له رنين يخرج من الخيشوم",
    },
  },

  {
    id: uuidv4(),
    character: "ن",
    outPut: " الشفتان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "التوسط",
      char2: "لغة : الاعتدال ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "غنة",
      char2: "غُنّة : صوت من الخيشوم",
      char3: `اصطلاحاً : ميل الحرف عند مخرجه لاعتراض اللسان طريقه`,
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "متوسط ",
      char3: "لتساوي صفات الضعف و صفات القوة",
    },
  },
  {
    id: uuidv4(),
    character: "ه",
    outPut: " اقصى الحلق",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "الخفاء",
      char2: "لغة : الاستتار ",
      char3: "اصطلاحاً : استتار صوت الحرف عند النطق به",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف جداً ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة   ",
    },
  },
  {
    id: uuidv4(),
    character: "و",
    outPut: "الشفتان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة وهي الجهر  ",
    },
  },
  {
    id: uuidv4(),
    character: "ي",
    outPut: "وسط اللسان",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة وهي الجهر  ",
    },
  },
  {
    id: uuidv4(),
    character: "المد",
    outPut: "الجوف",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "الخفاء",
      char2: "لغة : الاستتار ",
      char3: "اصطلاحاً : استتار صوت الحرف عند النطق به",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة وهي الجهر  ",
    },
  },
  {
    id: uuidv4(),
    character: "اللين",
    outPut: "الجوف",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الرخاوة",
      char2: "لغة : اللين ",
      char3: "اصطلاحاً : جريان الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "اللين",
      char2: "لغة : السهولة ",
      char3: "اصطلاحاً : خروجه من غير تكلف",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف ",
      char3:
        "لزيادة صفات الضعف وهما الرخاوة والاستفال والانفتاح على صفات القوة وهي الجهر  ",
    },
  },
];

export { headerData, bodyData };
