import {v4 as uuidv4} from "uuid"

const headerData = ["الحرف", "مخرجه", "صفاته", "مستوى قوة الحرف"];
const bodyData = [
  {
    id: uuidv4(),
    character: "ء",
    outPut: "أقصى الحلق",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشدة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "متوسط",
      char3:
        "لتساوي صفات القوة وهما الجهر والشدة مع صفات الضعف وهما الاستفال والانفتاح",
    },
  },
 
  {
    id: uuidv4(),
    character: "ب",
    outPut: " الشفتان بانطباقهما",
    prop1: {
      char1: "الجهر",
      char2: "لغة : الإعلان ",
      char3: "اصطلاحاً : انحباس النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "قلقلة",
      char2: "لغة : التحريك والاضطراب ",
      char3: "اصطلاحاً : قوى اضطراب صوت الحرف عند النطق به ساكناً",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "قوى",
      char3:
        "لزيادة صفات القوة وهما الجهر والشدة و القلقلة على صفات الضعف وهما الاستفال والانفتاح",
    },
  },
  {
    id: uuidv4(),
    character: "ت",
    outPut: "  طرف اللسان مع لثة الثنايا العليا بإلصاق",
    prop1: {
      char1: "الهمس",
      char2: "لغة : الإخفاء ",
      char3: "اصطلاحاً : جريان النفسِ عند النطق بالحرف",
    },
    prop2: {
      char1: "الشة",
      char2: "لغة : القوة ",
      char3: "اصطلاحاً : انحباس الصوت عند النطق بالحرف",
    },
    prop3: {
      char1: "استفال",
      char2: "لغة : انخفاض ",
      char3: "اصطلاحاً : عدم ارتفاع أقصى اللسان عند النطق فينخفض الصوت",
    },

    prop4: {
      char1: "انفتاح",
      char2: "لغة : الافتراق ",
      char3: "اصطلاحاً : انفتاح ما بين اللسان والحنك الاعلى",
    },
    prop5: {
      char1: "",
      char2: "",
      char3: "",
    },
    prop6: {
      char1: "مستوى قوة الحرف",
      char2: "ضعيف",
      char3:
        "لزيادة صفات الضعف وهما الهمس والاستفال والانفتاح و القلقلة على صفات القوة وهي الشدة فقط ",
    },
  },
 
];

export { headerData, bodyData };
